import styles from "./protection.module.scss";

function Protection() {
  return (
    <div className={styles.wrapper}>
      <h1 className={styles.title}>Data protection</h1>
      <p className={styles.heading}>
        Защита данных <br />
        Общие примечанияz
      </p>
      <p>
        Следующие примечания дают простой обзор того, что происходит с Вашими
        личными данными, когда Вы посещаете этот сайт. Личные данные — это все
        данные, с помощью которых вы можете быть идентифицированы лично.
        Подробную информацию по теме защиты данных см. в нашей декларации о
        защите данных, приведенной ниже.
      </p>

      <p className={styles.heading}>Сбор данных на этом сайте</p>
      <p className={styles.heading}>Кто отвечает за сбор данных на этом сайте?</p>
      <p>
        Обработку данных на этом сайте осуществляет оператор сайта. Его
        контактные данные можно найти в оттиске этого сайта.
      </p>

      <p className={styles.heading}>Как мы собираем ваши данные?</p>
      <p>
        С одной стороны, ваши данные собираются, когда вы предоставляете их нам.
        Это могут быть, например, данные, которые вы вводите в контактную форму.
      </p>
      <p>
        Остальные данные автоматически собираются нашими IT-системами при
        посещении сайта. В основном это технические данные (например,
        интернет-браузер, операционная система или время вызова страницы). Эти
        данные собираются автоматически, как только вы заходите на этот сайт.
      </p>

      <p className={styles.heading}>Для чего мы используем ваши данные?</p>
      <p>
        Часть данных собирается для обеспечения того, чтобы веб-сайт
        предоставлялся без ошибок. Другие данные могут быть использованы для
        анализа поведения пользователя.
      </p>

      <p className={styles.heading}>
        Какие у вас есть права в отношении ваших данных?
      </p>
      <p>
        Вы имеете право в любое время бесплатно получить информацию о
        происхождении, получателе и цели сохраненных вами личных данных. Вы
        также имеете право потребовать исправления или удаления этих данных. Для
        этого, а также для дальнейших вопросов, касающихся защиты данных, Вы
        можете в любое время связаться с нами по адресу, указанному в выходных
        данных. Кроме того, вы имеете право на обжалование в ответственном
        надзорном органе.
      </p>
      <p>
        Кроме того, вы имеете право при определенных обстоятельствах потребовать
        ограничения на обработку ваших персональных данных. Подробнее см.
        Декларацию о защите данных в разделе «Право на ограничение обработки».
      </p>

      <p className={styles.heading}>
        Инструменты анализа и сторонние инструменты
      </p>
      <p>
        Когда вы посещаете этот сайт, ваше поведение во время серфинга может
        быть оценено статистически. В основном это делается с помощью
        куки-файлов и так называемых аналитических программ. Анализ вашего
        поведения во время серфинга, как правило, анонимен; поведение во время
        серфинга не может быть прослежено до вас.
      </p>
      <p>
        Можно возразить против такого анализа или предотвратить его, не
        используя определенные инструменты. Подробную информацию об этих
        инструментах и о возможных вариантах возражений Вы найдете в следующем
        заявлении об охране данных.
      </p>

      <p className={styles.heading}>
        Сети хостинга и доставки контента (CDN)
        <br />
        Внешнее размещение
      </p>
      <p>
        Хостинг данного веб-сайта осуществляется внешним поставщиком услуг
        (хостером). Личные данные, собранные на этом сайте, хранятся на серверах
        хостера. Сюда могут входить, в частности, IP-адреса, контактные запросы,
        мета- и коммуникационные данные, данные о контрактах, контактная
        информация, имена, доступ к веб-сайту и другие данные, генерируемые
        веб-сайтом.
      </p>
      <p>
        Использование хостера осуществляется с целью выполнения договора с
        нашими потенциальными и существующими клиентами (ст. 6 ч. 1 л. b DSGVO)
        и в интересах безопасного, быстрого и эффективного предоставления нашего
        онлайн-оферты профессиональным провайдером (ст. 6 ч. 1 л. f DSGVO).
      </p>
      <p>
        Наш хостер будет обрабатывать Ваши данные только в объеме, необходимом
        для выполнения своих обязательств и будет следовать нашим инструкциям в
        отношении этих данных.
      </p>

      <p className={styles.heading}>
        Общие примечания и обязательная информация
        <br />
        Защита данных
      </p>
      <p>
        Операторы этих страниц очень серьезно относятся к защите Ваших личных
        данных. Мы обращаемся с Вашими персональными данными конфиденциально и в
        соответствии с законодательными положениями о защите данных и настоящей
        декларацией о защите данных.
      </p>
      <p>
        При использовании этого веб-сайта собираются различные личные данные.
        Личные данные — это данные, с помощью которых вы можете быть
        идентифицированы лично. Эта политика конфиденциальности объясняет, какие
        данные мы собираем и для чего мы их используем. Она также объясняет, как
        мы это делаем и с какой целью.
      </p>
      <p>
        Хотим отметить, что передача данных через Интернет (например, общение по
        электронной почте) может иметь пробелы в безопасности. Полная защита
        данных от доступа третьих лиц невозможна.
      </p>
      <p>
        Примечание на ответственный орган
        <br /> Лицом, ответственным за обработку данных на этом сайте, является
      </p>
      <p>
        Natalia Brauer
        <br />
        Glindkamp 5
        <br />
        49401 Damme
        <br />
        Телефон: 015752534371
        <br />
        электронная почта: info@almernaluxury.de
      </p>
      <p>
        Ответственным лицом является физическое или юридическое лицо, которое
        самостоятельно или совместно с другими принимает решение о целях и
        способах обработки персональных данных (например, имена, адреса
        электронной почты и т.д.).
      </p>
      <p>
        Многие операции по обработке данных возможны только с Вашего явного
        согласия. Вы можете отозвать любое уже данное согласие в любое время.
        Для этого достаточно неофициального уведомления по электронной почте.
        Законность обработки данных, осуществленной до момента отзыва, остается
        незатронутой.
      </p>

      <p className={styles.heading}>
        Право на возражение против сбора данных в особых случаях и на прямую
        рекламу (ст. 21 DSGVO)
      </p>
      <p>
        ЕСЛИ ОБРАБОТКА ДАННЫХ ОСУЩЕСТВЛЯЕТСЯ НА ОСНОВЕ ПРОИЗВЕДЕНИЙ ИСКУССТВА. 6
        ABS. 1 LIT. E ИЛИ FSGVO, ВЫ ИМЕЕТЕ ПРАВО В ЛЮБОЕ ВРЕМЯ ВОЗРАЗИТЬ ПРОТИВ
        ОБРАБОТКИ ВАШИХ ПЕРСОНАЛЬНЫХ ДАННЫХ ПО ПРИЧИНАМ, ВЫТЕКАЮЩИМ ИЗ ВАШЕЙ
        КОНКРЕТНОЙ СИТУАЦИИ, ВКЛЮЧАЯ ПРОФИЛИРОВАНИЕ НА ОСНОВЕ ЭТИХ ПОЛОЖЕНИЙ.
        СООТВЕТСТВУЮЩУЮ ПРАВОВУЮ ОСНОВУ, НА КОТОРОЙ ОСНОВЫВАЕТСЯ ОБРАБОТКА,
        МОЖНО НАЙТИ В ДАННОЙ ПОЛИТИКЕ КОНФИДЕНЦИАЛЬНОСТИ. В СЛУЧАЕ ВАШЕГО
        ВОЗРАЖЕНИЯ МЫ БОЛЬШЕ НЕ БУДЕМ ОБРАБАТЫВАТЬ ВАШИ ПЕРСОНАЛЬНЫЕ ДАННЫЕ,
        ЕСЛИ НЕ СМОЖЕМ ДОКАЗАТЬ, ЧТО СУЩЕСТВУЮТ ВЕСКИЕ ОСНОВАНИЯ ДЛЯ ОБРАБОТКИ,
        КОТОРЫЕ ЗАСЛУЖИВАЮТ ЗАЩИТЫ И ПЕРЕВЕШИВАЮТ ВАШИ ИНТЕРЕСЫ, ПРАВА И
        СВОБОДЫ, ИЛИ ЕСЛИ ОБРАБОТКА НЕ СЛУЖИТ ДЛЯ ПРЕДЪЯВЛЕНИЯ, ОСУЩЕСТВЛЕНИЯ
        ИЛИ ЗАЩИТЫ ПРАВОВЫХ ТРЕБОВАНИЙ (ВОЗРАЖЕНИЕ СОГЛАСНО СТ. 21 АБЗ. 1
        DSGVO).
      </p>
      <p>
        ЕСЛИ ВАШИ ПЕРСОНАЛЬНЫЕ ДАННЫЕ ОБРАБАТЫВАЮТСЯ С ЦЕЛЬЮ ПРЯМОГО МАРКЕТИНГА,
        ВЫ ИМЕЕТЕ ПРАВО В ЛЮБОЕ ВРЕМЯ ВОЗРАЗИТЬ ПРОТИВ ОБРАБОТКИ КАСАЮЩИХСЯ ВАС
        ПЕРСОНАЛЬНЫХ ДАННЫХ С ЦЕЛЬЮ ТАКОГО МАРКЕТИНГА, ВКЛЮЧАЯ ПРОФИЛИРОВАНИЕ, В
        ТОЙ МЕРЕ, В КАКОЙ ЭТО СВЯЗАНО С ТАКИМ ПРЯМЫМ МАРКЕТИНГОМ. В СЛУЧАЕ
        ВАШЕГО ВОЗРАЖЕНИЯ ВАШИ ПЕРСОНАЛЬНЫЕ ДАННЫЕ В ДАЛЬНЕЙШЕМ НЕ БУДУТ
        ИСПОЛЬЗОВАТЬСЯ В ЦЕЛЯХ ПРЯМОГО МАРКЕТИНГА (ВОЗРАЖЕНИЕ СОГЛАСНО СТ. 21
        АБЗ. 2 DSGVO).
      </p>

      <p className={styles.heading}>
        Право на обжалование в компетентном надзорном органе
      </p>
      <p>
        В случае нарушений DPA соответствующие лица имеют право на подачу
        апелляции в надзорный орган, в частности, в государстве-члене ЕС по
        месту своего обычного проживания, по месту работы или по месту
        предполагаемого нарушения. Это право на обжалование не наносит ущерба
        другим административным или судебным средствам правовой защиты.
      </p>

      <p className={styles.heading}>Право на портативность данных</p>
      <p>
        Вы имеете право на то, чтобы данные, которые мы обрабатываем
        автоматически на основании вашего согласия или при выполнении договора,
        передавались вам или третьей стороне в общем машиночитаемом формате.
        Если вы запрашиваете прямую передачу данных другому ответственному лицу,
        то это происходит только в той степени, в какой это технически возможно.
      </p>

      <p className={styles.heading}>Шифрование SSL или TLS</p>
      <p>
        Этот сайт использует SSL или TLS шифрование в целях безопасности и для
        защиты передачи конфиденциального содержимого, например, заказов или
        запросов, которые вы отправляете нам как оператор сайта. Вы можете
        распознать зашифрованное соединение по тому, что адресная строка
        браузера меняется с «http://» на «https://», а также по символу замка в
        строке браузерa.
      </p>
      <p>
        Если активировано шифрование SSL или TLS, данные, которые вы передаете
        нам, не могут быть прочитаны третьими лицами.
      </p>

      <p className={styles.heading}>
        Зашифрованные платежные транзакции на этом сайте
      </p>
      <p>
        Если после заключения договора с затратами существует обязательство
        предоставить нам Ваши платежные данные (например, номер счета для
        разрешения прямого дебетования), то эти данные необходимы для обработки
        платежей.
      </p>
      <p>
        Платежные операции с помощью обычных платежных средств (Visa/MasterCard,
        прямое дебетование) осуществляются исключительно по зашифрованному SSL
        или TLS соединению. Вы можете распознать зашифрованное соединение по
        тому, что адресная строка браузера меняется с «http://» на «https://», а
        также по символу замка в строке браузера.
      </p>
      <p>
        В случае зашифрованной связи, ваши платежные данные, которые вы
        передаете нам, не могут быть прочитаны третьими лицами.
      </p>

      <p className={styles.heading}>Информация, удаление и исправление</p>
      <p>
        В рамках действующего законодательства вы имеете право в любое время
        бесплатно получить информацию о сохраненных вами личных данных, их
        происхождении и получателях, а также о цели обработки данных и, в случае
        необходимости, право на исправление или удаление этих данных. Для этого,
        а также для дальнейших вопросов, касающихся личных данных, Вы можете в
        любое время связаться с нами по адресу, указанному в выходных данных.
      </p>

      <p className={styles.heading}>Право на ограничение обработки</p>
      <p>
        Вы имеете право запросить ограничение на обработку Ваших персональных
        данных. Для этого Вы можете в любое время связаться с нами по адресу,
        указанному в оттиске. Право на ограничение обработки существует в
        следующих случаях:
      </p>
      <p>
        Если вы оспариваете правильность ваших личных данных, хранящихся у нас,
        то, как правило, нам нужно время, чтобы это проверить. На время
        проведения обзора Вы имеете право потребовать ограничения на обработку
        Ваших персональных данных.
      </p>
      <p>
        Если обработка Ваших персональных данных была/является незаконной, Вы
        можете запросить ограничение на обработку вместо удаления.
      </p>
      <p>
        Если нам больше не нужны Ваши персональные данные, но они нужны Вам для
        осуществления, защиты или предъявления юридических претензий, Вы имеете
        право потребовать ограничения обработки Ваших персональных данных вместо
        их удаления.
      </p>
      <p>
        Если Вы подали возражение в соответствии с пунктом 1 статьи 21 DSGVO,
        необходимо найти баланс между Вашими и нашими интересами. До тех пор,
        пока не будет ясно, чьи интересы перевешивают интересы заинтересованных
        сторон, Вы имеете право требовать ограничения обработки Ваших
        персональных данных.
      </p>
      <p>
        Если Вы ограничили обработку Ваших персональных данных, эти данные —
        помимо их хранения — могут быть обработаны только с Вашего согласия или
        с целью предъявления, осуществления или защиты юридических претензий или
        защиты прав другого физического или юридического лица, или же по
        причинам, связанным с важными общественными интересами Европейского
        Союза или одного из государств-членов.
      </p>

      <p className={styles.heading}>
        Возражение против рекламных электронных писем
      </p>
      <p>
        Настоящим мы возражаем против использования контактных данных,
        опубликованных в рамках обязательства по выходу в свет, для рассылки
        рекламных и информационных материалов, не запрашиваемых в явном виде.
        Операторы этого сайта явным образом сохраняют за собой право
        предпринимать юридические действия в случае рассылки незапрашиваемой
        рекламной информации, например, спамовых электронных писем.
      </p>

      <p className={styles.heading}>
        Сбор данных на этом сайте <br />
        Cookies
      </p>
      <p>
        На наших интернет-страницах используются так называемые «куки-файлы».
        Файлы cookie представляют собой небольшие текстовые файлы и не причиняют
        вреда вашему конечному устройству. Они либо временно сохраняются на
        время сеанса (сессионные cookie-файлы), либо постоянно (постоянные
        cookie-файлы) на Вашем конечном устройстве. Сеансовые cookie-файлы
        автоматически удаляются по окончании вашего визита. Постоянные файлы
        cookie остаются на вашем устройстве до тех пор, пока вы сами их не
        удалите или пока ваш веб-браузер не разрешит их автоматически.
      </p>
      <p>
        В некоторых случаях при входе на наш сайт на вашем терминальном
        устройстве могут также сохраняться файлы cookie сторонних производителей
        (файлы cookie сторонних производителей). Они позволяют нам или Вам
        использовать определенные услуги сторонней компании (например,
        cookie-файлы для обработки платежных услуг).
      </p>
      <p>
        Файлы cookie имеют различные функции. Многие куки-файлы технически
        необходимы, так как некоторые функции сайта не работали бы без них
        (например, функция корзины для покупок или отображение видео). Другие
        cookie-файлы используются для оценки поведения пользователей или
        отображения рекламы.
      </p>
      <p>
        Cookie-файлы, которые необходимы для осуществления процесса электронной
        коммуникации или для обеспечения определенных функций, которые Вы
        запросили (например, функция корзины), хранятся на основании ст. 6 абз.
        1 л. f DSGVO. Оператор веб-сайта имеет законный интерес к хранению
        куки-файлов для технически безошибочного и оптимизированного
        предоставления своих услуг. Если было запрошено соответствующее согласие
        (например, согласие на хранение куки-файлов), то обработка
        осуществляется исключительно на основании ст. 6 абз. 1 л. DSGVO;
        согласие может быть отозвано в любое время.
      </p>
      <p>
        Вы можете настроить свой браузер таким образом, чтобы он информировал
        вас о настройках cookie-файлов и разрешал cookie-файлы только в
        отдельных случаях, исключал принятие cookie-файлов в конкретных случаях
        или вообще и активировал автоматическое удаление cookie-файлов при
        закрытии браузера. В случае деактивации куки-файлов функциональность
        данного сайта может быть ограничена.
      </p>
      <p>
        Если куки-файлы используются сторонними компаниями или в целях анализа,
        мы отдельно проинформируем Вас об этом в рамках данной декларации о
        защите данных и, при необходимости, запросим Ваше согласие.
      </p>

      <p className={styles.heading}>Лог-файлы сервера</p>
      <p>
        Поставщик страниц автоматически собирает и хранит информацию в так
        называемых лог-файлах сервера, которые ваш браузер автоматически
        передает нам. Это:
      </p>
      <p>
        Тип браузера и версия браузера
        <br />
        Используемая операционная система
        <br />
        URL реферала
        <br />
        Имя хоста подключающегося компьютера
        <br />
        Время запроса сервера
        <br />
        IP адрес
      </p>

      <p className={styles.heading}>
        Эти данные не объединяются с другими источниками данных.
      </p>
      <p>
        Эти данные зарегистрированы на основании ст. 6, п. 1 л. f ДСГВО.
        Оператор сайта имеет законный интерес к технически безошибочной
        презентации и оптимизации своего сайта — для этого должны быть записаны
        лог-файлы сервера.
      </p>

      <p className={styles.heading}>Форма контакта</p>
      <p>
        Если Вы отправите нам запрос через контактный формуляр, то Ваши данные
        из контактного формуляра, включая контактные данные, которые Вы там
        предоставите, будут сохранены нами для обработки запроса и в случае
        последующих вопросов. Мы не будем передавать эти данные без вашего
        согласия.
      </p>
      <p>
        Эти данные обрабатываются на основании ст. 6 абз. 1 л. b DSGVO в той
        мере, в какой Ваш запрос связан с выполнением договора или необходим для
        осуществления преддоговорных мероприятий. Во всех остальных случаях
        обработка основана на нашей законной заинтересованности в эффективной
        обработке адресованных нам запросов (статья 6, пункт 1 лит. f ДСГВО) или
        на Вашем согласии (статья 6, пункт 1 лит. a ДСГВО), при условии, что
        запрос был сделан.
      </p>
      <p>
        Данные, введенные Вами в контактный формуляр, останутся у нас до тех
        пор, пока Вы не потребуете от нас их удаления, не отозовете свое
        согласие на их хранение или не перестанете применяться цель, для которой
        они были сохранены (например, после обработки Вашего запроса).
        Обязательные правовые нормы — в частности, сроки хранения — остаются
        незатронутыми.
      </p>

      <p className={styles.heading}>
        Запрос по электронной почте, телефону или факсу
      </p>
      <p>
        Если Вы свяжетесь с нами по электронной почте, телефону или факсу, Ваш
        запрос, включая все персональные данные (имя, запрос), будет сохранен и
        обработан нами с целью обработки Вашего запроса. Мы не будем передавать
        эти данные без вашего согласия.
      </p>
      <p>
        Эти данные обрабатываются на основании п. 1 л. b ст. 6 DSGVO при
        условии, что Ваш запрос связан с выполнением контракта или необходим для
        осуществления преддоговорных мероприятий. Во всех остальных случаях
        обработка основана на Вашем согласии (статья 6, пункт 1 лит. a DSGVO)
        и/или на наших законных интересах (статья 6, пункт 1 лит. f DSGVO),
        поскольку мы имеем законный интерес в эффективной обработке Ваших
        данных.
      </p>

      <p className={styles.heading}>
        Социальные сети
        <br />
        Плагины для социальных сетей с тарифами
      </p>
      <p>
        Этот сайт использует плагины из социальных сетей (например, Facebook,
        Twitter, Instagram, Pinterest, XING, LinkedIn, Tumblr).
      </p>
      <p>
        Обычно плагины можно распознать по соответствующим логотипам в
        социальных сетях. Чтобы гарантировать защиту данных на этом сайте, мы
        используем эти плагины только в сочетании с так называемым «Тарифным»
        решением. Это приложение не позволяет интегрированным на этом сайте
        плагинам передавать данные соответствующему провайдеру при первом входе
        на сайт.
      </p>
      <p>
        Только при активации соответствующего плагина нажатием соответствующей
        кнопки устанавливается прямое соединение с сервером провайдера
        (согласие). Как только вы активируете плагин, соответствующий провайдер
        получает информацию о том, что вы посетили этот сайт с вашим IP-адресом.
        Если Вы одновременно входите в свой аккаунт в социальной сети (например,
        Facebook), соответствующий провайдер может назначить посещение этого
        сайта Вашему аккаунту пользователя.
      </p>
      <p>
        Активация плагина представляет собой согласие по смыслу пункта 1 статьи
        6 ДСГВО. Вы можете отозвать это согласие в любое время и на будущее.
      </p>

      <p className={styles.heading}>Плагин Instagram</p>
      <p>
        На данном сайте интегрированы функции сервиса Instagram. Эти функции
        предлагаются компанией Instagram Inc, 1601 Willow Road, Menlo Park, CA
        94025, США.
      </p>
      <p>
        Если Вы вошли в свой Instagram счет, Вы можете связать содержимое
        данного сайта с Вашим профилем Instagram, нажав на кнопку Instagram. Это
        позволяет компании Instagram связать Ваше посещение данного сайта с
        Вашим пользовательским аккаунтом. Хотим отметить, что мы, как провайдер
        сайтов, не имеем представления о содержании передаваемых данных или их
        использовании компанией Instagram.
      </p>
      <p>
        Хранение и анализ данных базируется на ст. 6, п. 1 л. f DSGVO. Оператор
        веб-сайта имеет законный интерес к как можно более широкому освещению в
        социальных сетях. Если было запрошено соответствующее согласие
        (например, согласие на хранение куки-файлов), то обработка
        осуществляется исключительно на основании ст. 6 абз. 1 л. DSGVO;
        согласие может быть отозвано в любое время.
      </p>
      <p>
        Дополнительную информацию см. в Instagram Data Protection Declaration:
        https://instagram.com/about/legal/privacy/.
      </p>

      <p className={styles.heading}>
        Инструменты анализа и реклама
        <br />
        Google Analytics
      </p>
      <p>
        Данный сайт использует функции сервиса веб-анализа Google Analytics.
        Провайдером является Google Ireland Limited («Google»), Gordon House,
        Barrow Street, Dublin 4, Ireland.
      </p>
      <p>
        Google Analytics использует так называемые «куки». Это текстовые файлы,
        которые хранятся на вашем компьютере и позволяют анализировать
        использование вами веб-сайта. Генерируемая cookie-файлом информация об
        использовании Вами данного веб-сайта обычно передается на сервер Google
        в США и хранится там.
      </p>
      <p>
        Хранение куки-файлов Google Analytics и использование этого инструмента
        анализа основано на ст. 6, п. 1 л. f DSGVO. Оператор сайта имеет
        законный интерес к анализу поведения пользователей с целью оптимизации
        как своего сайта, так и своей рекламы. Если было запрошено
        соответствующее согласие (например, согласие на хранение куки-файлов),
        то обработка осуществляется исключительно на основании ст. 6 абз. 1 л.
        DSGVO; согласие может быть отозвано в любое время.
      </p>

      <p className={styles.heading}>Анонимизация IP-адресов</p>
      <p>
        На этом сайте мы активировали функцию IP-анонимизации. Это означает, что
        перед отправкой в США ваш IP-адрес будет усечен компанией Google в
        странах-членах Европейского Союза или в других странах, подписавших
        Соглашение о европейском экономическом пространстве. Только в
        исключительных случаях полный IP-адрес передается на сервер Google в США
        и сокращается там. По поручению оператора данного сайта Google будет
        использовать эту информацию для оценки Вашего пользования сайтом, для
        составления отчетов о деятельности сайта и для предоставления дальнейших
        услуг оператору сайта в связи с использованием сайта и Интернета.
        IP-адрес, переданный Вашим браузером в рамках Google Analytics, не
        комбинируется с другими данными от Google.
      </p>

      <p className={styles.heading}>Плагин для браузера</p>
      <p>
        Вы можете отказаться от использования куки-файлов, выбрав
        соответствующие настройки в вашем браузере, однако обратите внимание,
        что в этом случае вы, возможно, не сможете использовать все функции
        этого сайта в полном объеме. Кроме того, Вы можете предотвратить сбор в
        Google данных, генерируемых куки-файлами и связанных с использованием
        Вами веб-сайта (включая Ваш IP-адрес), а также обработку этих данных
        компанией Google, загрузив плагин браузера, доступный по следующей
        ссылке, и установив его на Вашем компьютере.
      </p>

      <p className={styles.heading}>
        Поставщики услуг электронной коммерции и платежей <br />
        Обработка данных (данные о клиентах и договорах)
      </p>
      <p>
        Мы собираем, обрабатываем и используем личные данные только в той мере,
        в какой они необходимы для установления, содержания или изменения
        правоотношений (инвентаризационные данные). Это делается на основании
        ст. 6 ч. 1 л. b DSGVO, которая разрешает обработку данных для выполнения
        контракта или преддоговорных мер. Мы собираем, обрабатываем и используем
        личные данные об использовании данного сайта (данные об использовании)
        только в объеме, необходимом для того, чтобы предоставить пользователю
        возможность пользоваться услугой или взимать с него плату за пользование
        услугой.
      </p>
      <p>
        Собранные данные клиента будут удалены после завершения заказа или
        прекращения деловых отношений. Юридические сроки хранения остаются
        незатронутыми.
      </p>
      <p>
        Передача данных при заключении договора для интернет-магазинов, дилеров
        и отправки товаров
      </p>
      <p>
        Мы передаем персональные данные третьим лицам только в том случае, если
        это необходимо для выполнения договора, например, компаниям,
        уполномоченным на поставку товара, или кредитной организации,
        уполномоченной на обработку платежей. Дальнейшая передача данных не
        производится или только в том случае, если вы дали на это явное
        согласие. Ваши данные не будут переданы третьим лицам без Вашего явного
        согласия, например, в рекламных целях.
      </p>
      <p>
        Основой для обработки данных является ст. 6 абз. 1 л. b DSGVO, которая
        разрешает обработку данных для выполнения договора или преддоговорных
        мероприятий.
      </p>

      <p className={styles.heading}>PayPal</p>
      <p>
        На этом сайте мы предлагаем оплату через PayPal среди прочего.
        Поставщиком данной платежной услуги является PayPal (Europe) S.à.r.l. et
        Cie, S.C.A., 22-24 Boulevard Royal, L-2449 Luxembourg (далее «PayPal»).
      </p>
      <p>
        Если вы выберете оплату через PayPal, введенные вами платежные данные
        будут переданы в PayPal.
      </p>
      <p>
        Передача Ваших данных в PayPal осуществляется на основании пункта 1
        статьи 6 a DSGVO (согласие) и пункта 1 статьи 6 b DSGVO (обработка в
        целях выполнения договора). Вы имеете возможность в любое время отозвать
        свое согласие на обработку данных. Отзыв не влияет на эффективность
        операций по обработке данных, выполненных в прошлом.
      </p>
    </div>
  );
}

export default Protection;
